{
    "1": {
      "q": "The concept of entrepreneurship has a variety of meanings. It was first used in the early",
      "a": "18th century."
    },
    "2": {
      "q": "Who was the first man to use the concept of entrepreneurship?",
      "a": "Cantillon"
    },
    "3": {
      "q": "The word entrepreneurship was derived from the French word",
      "a": "entrepreneur"
    },
    "4": {
      "q": "Means to Undertake?",
      "a": "entreprendre"
    },
    "5": {
      "q": "To simply means to start a business/enterprise?",
      "a": "undertake"
    },
    "6": {
      "q": "Is the process and activities of nurturing and sustaining a business enterprise?",
      "a": "entrepreneurship"
    },
    "7": {
      "q": "An enterprise is created by?",
      "a": "entrepreneur"
    },
    "8": {
      "q": "As a concept, entrepreneurship is a process of identifying investment opportunities in one's environment and pulling resources together for the formation of an enterprise, taking the risk involved and maximizing profit thereof?",
      "a": "entrepreneurship"
    },
    "9": {
      "q": "According to an Australian Economist, the single function which constitutes entrepreneurship concept is innovation, such innovation results in new demand?",
      "a": "Joseph Schumpeter"
    },
    "10": {
      "q": "Entrepreneurship is therefore a process which involves the creation of an innovative economic organization for the purpose of gain or growth under the condition of risk and uncertainty?",
      "a": "entrepreneurship"
    },
    "11": {
      "q": "Hisrich, Peters state entrepreneurship is a continuous process of creating something different that has value to the users?",
      "a": "entrepreneurship"
    },
    "12": {
      "q": "UNDP stands for?",
      "a": "United Nations development program"
    },
    "13": {
      "q": "UNDP defines entrepreneurship as the process of using private initiative to transform a business concept into a new venture or to grow and diversify an existing venture or enterprise with high growth potential?",
      "a": "UNDP - United Nation development program"
    },
    "14": {
      "q": "Innovation implies the provision of a new and useful idea and its immediate transfer to market as well as its usage in an organization in order to produce cheaper and better products or obtain more efficient support for customers?",
      "a": "Innovation"
    },
    "15": {
      "q": "In fact, Innovation means making practical those thoughts arising from creativity?",
      "a": "Innovation"
    },
    "16": {
      "q": "Creativity is to use mental capabilities to provide new thoughts?",
      "a": "Creativity"
    },
    "17": {
      "q": "In spite of the differences in the definition of entrepreneurship, there are some certain or common aspects like taking, (ii) creativity, (iii) Independence, (iv) rewards. and?",
      "a": "risk"
    },
    "18": {
      "q": "Entrepreneur is anyone who has the capacity and willingness to undertake the conception, organization, and management of productive venture with all attendant risks, while seeking profit as a reward?",
      "a": "Entrepreneur"
    },
    "19": {
      "q": "Individuals who attempt to predict and act upon change within markets?",
      "a": "Entrepreneurs"
    },
    "20": {
      "q": "Defined as the innovator who implements change within markets through the carrying out of new combinations such as introduction of new techniques of production, re-organisation of an industry and innovation?",
      "a": "Schumpeter"
    },
    "21": {
      "q": "According to (2010), an entrepreneur is the person who perceives the market opportunity, motivates, drives and mobilizes resources to meet it?",
      "a": "Di - Masi"
    },
    "22": {
      "q": "The following are characteristics of an entrepreneur except?",
      "a": "speed"
    },
    "23": {
      "q": "Somebody who is self-assertive, confident, independent, optimistic and has positive mental attitude?",
      "a": "Self-confidence"
    },
    "24": {
      "q": "Someone who can take up challenges?",
      "a": "Risk Taking"
    },
    "25": {
      "q": "Someone with a need for achievement, who is profit-oriented, persistent, determined, hardworking and takes initiatives?",
      "a": "Taking-result Oriented"
    },
    "26": {
      "q": "The following are roles of entrepreneurs?",
      "a": "Visionary/innovative roles, Social roles, Technological roles, Managerial roles, Economic roles"
    },
    "27": {
      "q": "These entrepreneurs have the ability to think newer, better and more economical ideas of business organization and management?",
      "a": "Innovative Entrepreneurs"
    },
    "28": {
      "q": "The dictionary meaning of the term 'Fabian' is a person seeking victory by delay rather than by a decisive battle?",
      "a": "Fabian"
    },
    "29": {
      "q": "The dictionary meaning of the term_______ a person who lives on the labor of others is?",
      "a": "Drone"
    },
    "30": {
      "q": "Entrepreneurs that are resistant to change. They are considered as 'Old school'?",
      "a": "Drone Entrepreneurship"
    },
    "31": {
      "q": "Drive social innovation and transformation in various fields including education, health, human rights, worker's rights, environment and expertise development?",
      "a": "Social Entrepreneur"
    },
    "32": {
      "q": "An individual can decide to be on his/her own for the following reasons?",
      "a": "Push factors, Pull Factors and Supportive Factors"
    },
    "33": {
      "q": "Defined as a method by which an individual or a group of individuals, in association with existing organizations, create a new organization or initiate renewal or innovation within the organization?",
      "a": "Corporate entrepreneurship"
    },
    "34": {
      "q": "A company's effort at renewal through innovation and new business development and through venturing?",
      "a": "Corporate entrepreneurship"
    },
    "35": {
      "q": "Involves adding new business (or portions of new business via equity investments) to the corporation?",
      "a": "Corporate venturing"
    },
    "36": {
      "q": "Involves the exhibition of large scale or otherwise highly consequential innovations that are adopted in firm's pursuit of competitive advantage?",
      "a": "Strategic Entrepreneurship"
    },
    "37": {
      "q": "Defines corporate entrepreneurship whereby an organization seeks to expand by exploring new opportunities through new combination of its existing resources?",
      "a": "Intrapreneurship"
    },
    "38": {
      "q": "Refers to the processes and activities by which corporate organizations behave entrepreneurially?",
      "a": "Intrapreneurship"
    },
    "39": {
      "q": "Every activity enhances a company's competitive advantage?",
      "a": "Innovative"
    },
    "40": {
      "q": "Every innovative activity enhances a company's Competitive Advantage?",
      "a": "Competitive Advantage"
    },
    "41": {
      "q": "These factors that encourage intrapreneurship according to Guth-Ginsberg (1990) include?",
      "a": "The External Environment, The Organizational Setting and Its strategies, Management Activities, Employee's Attitude"
    },
    "42": {
      "q": "The theories of entrepreneurship can be grouped into five (5) classes:",
      "a": "a. Economic entrepreneurship theory\nb. Psychological entrepreneurship theory\nc. Sociological entrepreneurship theory\nd. Opportunity-based entrepreneurship theory\ne. Resourced-based entrepreneurship theory Mnemonic EPSOR"
    },
    "43": {
      "q": "AMP stands for?",
      "a": "Australian market process"
    },
    "44": {
      "q": "SSB stands for?",
      "a": "Small Scale business"
    },
    "45": {
      "q": "GDP stands for?",
      "a": "Gross domestic product"
    },
    "46": {
      "q": "Schumpeter (1951) opined that this French economist was the first to introduce the concept of entrepreneur in his work in 1755?",
      "a": "Richard Cantillon"
    },
    "47": {
      "q": "Cantillon recognizes in economic system three types of agents?",
      "a": "Landowners (Capitalists), entrepreneurs (arbitragers), Labourer ('wageworkers')"
    },
    "48": {
      "q": "The entrepreneurial class accomplishes its task by engaging in pure,?",
      "a": "Arbitrage"
    },
    "49": {
      "q": "Means simultaneous purchase and sale of an asset in order to profit from a difference in price?",
      "a": "Arbitrage"
    },
    "50": {
      "q": "Cantillon thus recognizes that arbitrage always involves?",
      "a": "Uncertainty"
    },
    "51": {
      "q": "Say was French and a classical Economist. He was an Industrialist?",
      "a": "Jean-Baptiste Say"
    },
    "52": {
      "q": "Say that an entrepreneur is one who combines the land of one, the labor of another and the capital of yet another and thus produces a product?",
      "a": "Jean-Baptiste Say"
    },
    "53": {
      "q": "To say an entrepreneur, shifts economic resources out of an area of lower productivity and into an area of higher productivity and greater yield?",
      "a": "Jean-Baptiste Say"
    },
    "54": {
      "q": "Entrepreneur has been seen from three major perspectives, namely:",
      "a": "Economic perspective, Socio-behavioral perspective, Managerial Perspective"
    },
    "55": {
      "q": "Under the Economic Perspective, entrepreneurship is seen as a vocation, high-risk occupation, and venture creation?",
      "a": "Economic Perspective"
    },
    "56": {
      "q": "Under the Managerial perspective, entrepreneurship is seen as the creation of an organization, innovation and leadership?",
      "a": "Managerial perspective"
    },
    "57": {
      "q": "Under the Socio-Behavioral perspective, entrepreneurship is seen as a force, change agent, and culture?",
      "a": "Socio-Behavioral perspective"
    },
    "58": {
      "q": "The socio-Behavioral perspective holds that entrepreneurs are:",
      "a": "Change agents"
    },
    "59": {
      "q": "Believed that entrepreneurs emerge as a result of the interplay between social, economic and psychological factors?",
      "a": "Hossain (1998)"
    },
    "60": {
      "q": "When classified on the basis of motivation, we have?",
      "a": "Business entrepreneurs, Social entrepreneurs, Induced entrepreneurs, Spontaneous entrepreneurs"
    },
    "61": {
      "q": "They initiate and establish profit-oriented business enterprises?",
      "a": "Business entrepreneurs"
    },
    "62": {
      "q": "They create enterprises with a view to rendering social and philanthropic services to the society?",
      "a": "Social entrepreneurs"
    },
    "63": {
      "q": "These are persons who have no formal training to become entrepreneurs but who are prompted to establish enterprises due to the policy measures of the government that provide assistance, incentives, and concessions?",
      "a": "Induced entrepreneurs"
    },
    "64": {
      "q": "These entrepreneurs are persons with initiative, boldness and confidence in their ability which activate them to undertake entrepreneurial activity?",
      "a": "Spontaneous entrepreneurs"
    },
    "65": {
      "q": "On the basis of type of business, entrepreneurs are classified into:",
      "a": "Business, Trading, Industrial, Corporate"
    },
    "66": {
      "q": "They are concerned with manufacturing activities?",
      "a": "Industrial Entrepreneurs"
    },
    "67": {
      "q": "They undertake trading activities and are not concerned with the manufacturing work?",
      "a": "Trading Entrepreneurs"
    },
    "68": {
      "q": "These are the individuals who plan, develop and manage a corporate body?",
      "a": "Corporate entrepreneurs"
    },
    "69": {
      "q": "Based on the use of technology, entrepreneurs can be classified into:",
      "a": "Technical, Non-technical, Professional"
    },
    "70": {
      "q": "They make use of new technology in their process of production?",
      "a": "Technical entrepreneurs"
    },
    "71": {
      "q": "They are concerned with the use of alternative and imitative methods of marketing and distribution strategies to make their business survive?",
      "a": "Non-technical Entrepreneurs"
    },
    "72": {
      "q": "These entrepreneurs possess extensive knowledge of their profession and make use of their skills in the operation of the enterprise?",
      "a": "Professional Entrepreneurs"
    },
    "73": {
      "q": "The entrepreneur conceives the idea of a new product/service and prepares a business plan?",
      "a": "Conception stage"
    },
    "74": {
      "q": "The entrepreneur makes an assessment of market demand, financial and technical viability?",
      "a": "Assessment stage"
    },
    "75": {
      "q": "The entrepreneur assembles the required resources to start the business?",
      "a": "Formation stage"
    },
    "76": {
      "q": "The entrepreneur starts the business?",
      "a": "Establishment stage"
    },
    "77": {
      "q": "The entrepreneur expands the business?",
      "a": "Expansion stage"
    },
    "78": {
      "q": "The entrepreneur monitors the operations of the business?",
      "a": "Monitoring stage"
    },
    "79": {
      "q": "The entrepreneur devises an appropriate growth strategy for the business?",
      "a": "Growth stage"
    },
    "80": {
      "q": "The entrepreneur assesses the market demand, financial and technical viability?",
      "a": "Assessment stage"
    },
    "81": {
      "q": "The entrepreneur makes an assessment of market demand, financial and technical viability?",
      "a": "Assessment stage"
    },
    "82": {
      "q": "The entrepreneur assembles the required resources to start the business?",
      "a": "Formation stage"
    },
    "83": {
      "q": "The entrepreneur starts the business?",
      "a": "Establishment stage"
    },
    "84": {
      "q": "The entrepreneur expands the business?",
      "a": "Expansion stage"
    },
    "85": {
      "q": "The entrepreneur monitors the operations of the business?",
      "a": "Monitoring stage"
    },
    "86": {
      "q": "The entrepreneur devises an appropriate growth strategy for the business?",
      "a": "Growth stage"
    },
    "87": {
      "q": "An entrepreneur can be classified as?",
      "a": "The Nascent Entrepreneur, The Novice Entrepreneur, The Habitual Entrepreneur, The Serial Entrepreneur, The Portfolio Entrepreneur"
    },
    "88": {
      "q": "These are the people who are not yet operating a business but are taking steps to start one?",
      "a": "The Nascent Entrepreneur"
    },
    "89": {
      "q": "These are the people who have started their first business?",
      "a": "The Novice Entrepreneur"
    },
    "90": {
      "q": "These are the people who have started two or more businesses?",
      "a": "The Habitual Entrepreneur"
    },
    "91": {
      "q": "These are the people who have started several businesses either simultaneously or one after another?",
      "a": "The Serial Entrepreneur"
    },
    "92": {
      "q": "These are the people who have ownership stakes in several ventures simultaneously?",
      "a": "The Portfolio Entrepreneur"
    },
    "93": {
      "q": "Theories of entrepreneurship include?",
      "a": "Economic Theory, Psychological Theory, Sociological Theory, Anthropological Theory, Opportunity-Based Theory, Resource-Based Theory, Eclectic Theory"
    },
    "94": {
      "q": "The Economic Theory of entrepreneurship holds that?",
      "a": "Entrepreneurship and economic growth take place when economic conditions are favorable"
    },
    "95": {
      "q": "According to the Psychological Theory, the characteristics of entrepreneurs include?",
      "a": "Need for achievement, Risk-taking propensity, Tolerance for ambiguity"
    },
    "96": {
      "q": "The Sociological Theory holds that?",
      "a": "Entrepreneurial behavior is influenced by social contexts"
    },
    "97": {
      "q": "The Anthropological Theory posits that?",
      "a": "Culture plays a significant role in shaping entrepreneurial behavior"
    },
    "98": {
      "q": "The Opportunity-Based Theory of entrepreneurship suggests that?",
      "a": "Entrepreneurs are able to identify and exploit opportunities that others do not see"
    },
    "99": {
      "q": "The Resource-Based Theory argues that?",
      "a": "Access to resources is critical for entrepreneurial success"
    },
    "100": {
      "q": "The Eclectic Theory integrates various perspectives and suggests that?",
      "a": "Entrepreneurship is a complex phenomenon influenced by multiple factors"
    }
  }
  